#!/usr/bin/env python
# coding: utf-8

# # 1.จงเขียนโปรแกรม คำนวณอายุ โดยให้ผู้ใช้งานป้อนข้อมูลปีเกิดผ่านทางคีย์บอร์ด กำหนดให้ภายในโปรแกรม ต้องมีการใช้ฟังก์ชันแปลงชนิดข้อมูลก่อนนำไปคำนวณ

# In[1]:


a=2562
b=flot(input)
c=flot(a-b)
d=print(c)


# # 2.จงเขียนโปรแกรมคำนวณการซื้อสินค้า 3อย่าง โดยรับราคาสินค้าจากผู้ใช้ผ่านคีย์บอร์ด พร้อมแสดงราคาสินค้าแต่ละชิ้นหลังผู้ใช้ป้อนค่าเสร็จ ตามด้วยสรุปราคารวมของสินค้าที่ซื้อทั้งหมด เมื่อโปรแกรมทำงานเสร็จให้แสดงข้อความว่า"Good Bye!!"

# In[2]:


a=flot(input)
b=flot(input)
c=flot(input)
d=flot(a+b+c)
e=print"a","b","c",flot(d)"Good Bye!!"


# # 3.จงเขียนโปรแกรมวนซ้ำโดยบังคับใช้คำสั่ง for ให้แสดงผลสูตรคูณแม่ ๒

# In[ ]:





# # 4.จงเขียนโปรแกรมวนซ้ำโดยบังคับใช้คำสั่ง while ให้แสดงคำว่า"Hello"๑ บรรทัด และคำว่า "World"อีกบรรทัด จำนวน๕ครั้ง

# In[4]:


a="Hello"
b="World"
while a:"Hello"
      b:"World"


# In[ ]:




